Tekla Open API Reference for Tekla Structures 2025
Mesh Methods
The Mesh type exposes the following members.
Methods
Name | Description
AddLine
 Adds a new line in the mesh.
AddPoint
 Adds a new point in the mesh.
AddTriangle
 Adds a new triangle in the mesh.
Top
See Also
Reference
Mesh Class
Tekla.Structures.Model.UI Namespace